import React from 'react';

export default function TernaryOperator() {
  const isLoggedIn = true; // येथे आपण लॉगिन केलेले असल्यास true सेट केले आहे

  return (
    <>
      <h1>टर्नरी ऑपरेटर</h1>
      <p>
        टर्नरी ऑपरेटर (?:) एक संक्षिप्त शर्त आहे जी एकच ओळीत कंडीशन चेक करून मूल्ये परत करते.
        सामान्यतः, त्याचा वापर 'if' स्टेटमेंटऐवजी करतात.
      </p>
      <p>
        उदाहरणार्थ, जर आपल्याला तपासायचे असेल की वापरकर्ता लॉगिन केलेला आहे का, तर आपण टर्नरी ऑपरेटरचा उपयोग करू शकता:
      </p>
      <p>
        {isLoggedIn ? 'आपण लॉगिन केले आहे!' : 'कृपया लॉगिन करा!'}
      </p>
    </>
  );
}
